[
  {
    "id": "three_act",
    "name": "三幕構成",
    "description": "古典的な物語構造。第1幕で設定と主要な登場人物を紹介、第2幕で葛藤の深化と高まり、第3幕で解決と結末へと導く。",
    "structure": {
      "episode1": "【第1幕：設定と出会い】\n主人公と状況の紹介、主要な登場人物との出会い、性的な緊張感や興味の芽生え。基本的な設定と魅力を確立しつつ、官能的な関係性を予感させる展開に。",
      "episode2": "【第2幕：葛藤と発展】\n性的な関係の発展と同時に葛藤や障害が発生。この障害は外的なもの（社会的制約、立場の違いなど）でも内的なもの（罪悪感、躊躇いなど）でもよい。官能的な描写を深めながら、心理的な複雑さも表現。",
      "episode3": "【第3幕：クライマックスと解決】\n性的・感情的な頂点へと至り、葛藤の解決または受容へ。最も官能的で感情的に高まる場面を描写し、二人の関係の今後についての示唆や解決で締めくくる。"
    }
  },
  {
    "id": "kishoutenketsu",
    "name": "起承転結",
    "description": "日本の伝統的な四段構成。「起」で状況を紹介、「承」で展開、「転」で意外な展開、「結」で解決へと導く。",
    "structure": {
      "episode1": "【起：導入】\n登場人物と設定の紹介。二人の初めての出会いや最初の印象、互いに対する魅力や引力を描写。官能的な緊張感を控えめに示唆しつつ、これからの展開の伏線を張る。",
      "episode2": "【承：展開】\n関係の発展。互いへの関心が高まり、初めての親密な接触や官能的な雰囲気の描写。感情と肉体の両面で距離が縮まっていく過程を描く。",
      "episode3": "【転：意外な展開】\n予想外の展開や障害の出現。関係性に新たな要素が加わる、または予期せぬ展開で状況が一変する。官能と感情の両面で強い転換点をもたらし、物語に深みを与える。",
      "episode4": "【結：解決と結末】\n転換点を経た後の解決と結末。最も官能的で感情的に満たされるクライマックスシーンを描き、二人の関係の行方や心理的変化の帰着点を示す。"
    }
  },
  {
    "id": "hero_journey",
    "name": "英雄の旅",
    "description": "キャンベルの「千の顔を持つ英雄」に基づく構造。主人公が日常から非日常の世界へ旅立ち、試練を経て成長し帰還する。",
    "structure": {
      "episode1": "【日常世界と冒険への呼びかけ】\n主人公の日常と内面的な欲求や不満を紹介。官能的な冒険への「呼びかけ」が何らかの形で訪れる。最初は躊躇いがあるかもしれないが、最終的に一線を越えることを決意する。",
      "episode2": "【非日常世界への越境】\n見知らぬ官能の領域への踏み込み。新たな感覚や体験との出会い、「メンター」の役割を果たす人物の導きがあるかもしれない。刺激的で未知の体験を通じて、主人公の内面にも変化が生じ始める。",
      "episode3": "【試練と変容】\n官能的な冒険の中での試練と困難。欲望と理性の間での葛藤、または社会的/個人的な障壁との対峙。これらの試練を通じて主人公は変容し、より深い官能と自己理解に至る。",
      "episode4": "【帰還と統合】\n官能的な旅を経て、主人公は変容した自分として「日常」に帰還する。その体験を自分の人生や自己認識に統合し、新たな視点や在り方を獲得する。官能的なクライマックスと精神的な実現が融合した結末。"
    }
  },
  {
    "id": "five_stage_ntr",
    "name": "寝取られ5段階",
    "description": "寝取られ系の物語に特化した5段階構造。徐々に関係が変化していく過程を丁寧に描く。",
    "structure": {
      "episode1": "【第1段階：日常と出会い】\n現在のパートナーとの関係と日常を描写。第三者との出会いと、初めての魅力や引力を感じる瞬間。まだ罪悪感が強く、葛藤が中心。",
      "episode2": "【第2段階：境界線の曖昧化】\n第三者との距離が徐々に縮まる。何気ない接触や会話が増え、互いへの関心が高まる。パートナーとの関係に小さな亀裂が生じ始める。心理的な葛藤と官能的な緊張感の描写。",
      "episode3": "【第3段階：一線を越える】\n決定的な一線を越える瞬間。強い罪悪感と快感が入り混じる複雑な心理描写。パートナーへの思いと新たな関係の間で揺れ動く感情。",
      "episode4": "【第4段階：関係の深化】\n第三者との関係が深まり、パートナーとの関係が変質していく。罪悪感と快感のバランスが変化し、新たな関係に傾いていく心理過程。",
      "episode5": "【第5段階：新たな均衡】\n全ての関係性の再定義と新たな均衡の形成。主人公の心理的変化と、三者の関係性がどのような形に落ち着くかを描く。心理的な解放や葛藤の解決が官能描写と融合。"
    }
  },
  {
    "id": "emotional_arc",
    "name": "感情的弧",
    "description": "主人公の感情変化を中心に据えた構造。特に官能小説では内面的な変化と肉体的な体験を連動させる。",
    "structure": {
      "episode1": "【抑制】\n主人公の抑制された欲望や願望を描写。社会的規範や自己抑制によって押さえ込まれている感情や欲求。そこに小さな亀裂や変化の可能性が生まれる。",
      "episode2": "【覚醒】\n何らかのきっかけで内なる欲望や感情が目覚め始める。初めての官能的な体験や、長く押し殺していた感情の解放。戸惑いや罪悪感と快感が混在する。",
      "episode3": "【葛藤】\n欲望の追求と社会的/個人的な制約との葛藤。より強く深い官能体験を求める一方で、様々な障壁や葛藤に直面する。内面的な成長や変化が始まる。",
      "episode4": "【解放】\n最終的な感情と欲望の解放。最も官能的で感情的に満たされるクライマックス。同時に主人公の内面的な変容や気づき、新たな自己受容が描かれる。"
    }
  }
]